#include <main-proteus.h>
                  //Πρέπει να τοποθετηθεί οπωσδήποτε στον ίδιο φάκελο στον οποίο θα 
                  //αναπτύξετε το project σας.
#byte PORTB=0xF81 //F81 είναι η θέση τη καταχωρητή δεδομένων της πόρτας Β
                  // στην μνήμη του μικροελεγκτή
#byte PORTD=0xF83  //F83 είναι η θέση τη καταχωρητή δεδομένων της πόρτας D
                  // στην μνήμη του μικροελεγκτή

// *********Από εδώ αρχίζει το κύριο πρόγραμμα************************

void main()
{                   //άνοιγμα αγκύλης της συνάρτησης main

set_tris_b(0x00);   //Η θύρα Β γίνεται έξοδος(καταχωρητής κατεύθυνσης=0000 0000)
set_tris_d(0xff);   //Η θύρα D γίνεται είσοδος(καταχωρητής κατεύθυνσης=1111 1111)

PORTB=0b00000000;   // Στην πόρτα Β δίνεται η αρχική τιμή 0000 0000

int a;              // Ορισμός ακέραιης μεταβλητής a για αποθήκευση του περιεχομένου
                    // της πόρτας D
int i;              // ακέραιη μεταβλητή που χρησιμοποιούμε μέσα στην for
                    // Με την παρακάτω δομή while(TRUE){   } εκτελείται για αενάως(για πάντα) το σύνολο των 
                    // εντολών που είναι μέσα στις αγκύλες. Η δεσμευμένη λέξη TRUE στη γλώσσα C αντιστοιχεί
                    // στην αληθή συνθήκη. Αντί για TRUE θα μπορούσαμε για παράδειγμα να βάλουμε 5>1,
                    // δηλαδή μια συνθήκη που ισχύει πάντα.

while(TRUE) {              //Βρόχος που δεν τελειώνει ποτέ(συνθήκη πάντα αληθής)
            a=PORTD;        //ανάγνωση του περιεχομένου της πόρτας D και μεταφορά του
                            // στη μεταβλητή a
            switch (a){
                       case 0:  PORTB=0xFF; delay_ms(100); PORTB=0x00; delay_ms(100);
                                // Πρόγραμμα αναβοσβησίματος όταν a=0 (PORTD = 0000 0000)
                                break;
                       
                       case 1: PORTB=0b11000011;delay_ms(100);PORTB=0b00111100; delay_ms(100);
                                // Πρόγραμμα αναβοσβησίματος όταν a=1 (PORTD = 0000 0001)
                               break;
            
                       case 2:PORTB=0b10101010;delay_ms(100);PORTB=0b01010101; delay_ms(100);   
                                // Πρόγραμμα αναβοσβησίματος όταν a=2 (PORTD = 0000 0010)
                              break;
                       
                       case 3:PORTB=0b10000000;for(i=1;i<=7;i++) {delay_ms(50);PORTB=PORTB/2;} delay_ms(50);
                                // Πρόγραμμα αναβοσβησίματος όταν a=3 (PORTD = 0000 0011)
                              break;
                       
                       case 4:PORTB=0xF0; delay_ms(100); PORTB=0x0F; delay_ms(100);
                                // Πρόγραμμα αναβοσβησίματος όταν a=4 (PORTD = 0000 0100)
                                break;
                       
                     } // κλείσιμο της αγκύλης του switch

            }   //κλείσιμο της αγκύλης του while

}      // κλείσιμο της αγκύλης του main

